       01  PRODUCT-MASTER-RECORD.
      *
           05  PRM-PRODUCT-CODE                PIC X(10).
           05  PRM-PRODUCT-DESCRIPTION         PIC X(20).
           05  PRM-UNIT-PRICE                  PIC S9(07)V99  COMP-3.
           05  PRM-QUANTITY-ON-HAND            PIC S9(07)     COMP-3.
      *
